app/views/blogs/index.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."blog_id" = $2 LIMIT $3  [["user_id", 1], ["blog_id", 6], ["LIMIT", 1]]
---
      <% end %>
      <% if current_user.favorites.find_by(blog_id: blog.id).present? %>