app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "content") VALUES ($1, $2) RETURNING "id"  [["title", "test1"], ["content", "test1"]]
UPDATE "blogs" SET "user_id" = $1 WHERE "blogs"."id" = $2  [["user_id", 1], ["id", 8]]
---
  def create
    @blog = Blog.create(blog_params)
    @blog.user_id = current_user.id
    if @blog.save

UPDATE "blogs" SET "title" = $1, "content" = $2 WHERE "blogs"."id" = $3  [["title", "test3"], ["content", "test3"], ["id", 1]]
---
  def update

    if @blog.update(blog_params)

DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 1]]
---
  def destroy
    @blog.destroy

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_blog
    @blog = Blog.find(params[:id])