app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "contact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test1"], ["email", "test@gmail.com"], ["contact", "届いてるといいな"], ["created_at", "2018-05-14 13:54:22.651337"], ["updated_at", "2018-05-14 13:54:22.651337"]]