app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.create(blog_id: params[:blog_id])
    redirect_to blogs_url, notice: "#{User.find(Blog.find(params[:blog_id]).user_id).name}さんのブログをお気に入り登録しました"
---
INSERT INTO "favorites" ("user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["blog_id", 6], ["created_at", "2018-05-13 22:26:16.373120"], ["updated_at", "2018-05-13 22:26:16.373120"]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    favorite = current_user.favorites.find_by(blog_id: params[:blog_id]).destroy
    redirect_to blogs_url, notice: "#{User.find(Blog.find(params[:blog_id]).user_id).name}さんのブログをお気に入り解除しました"
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 2]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."user_id" IS NULL AND "favorites"."blog_id" IS NULL LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]