app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new
    @picture.image.retrieve_from_cache! params[:cache][:image]

    if @picture.save
---
INSERT INTO "pictures" ("image", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image", "YAMADA_0001.jpg"], ["created_at", "2018-05-18 01:18:42.454685"], ["updated_at", "2018-05-18 01:18:42.454685"]]

  def update
    respond_to do |format|
      if @picture.update(picture_params)
---
UPDATE "pictures" SET "image" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["image", "YAMADA_0003.jpg"], ["updated_at", "2018-05-18 04:44:13.815829"], ["id", 2]]

  def destroy
    @picture.destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 1]]

    def set_picture
      @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]